namespace A02判断字符串重复出现字符次数
{
    class Program
    {
        static void Main(string[] args)
        {
            //IndexOf找出字符串里最早出现字符的位置
            string str = "人生得意须尽欢，莫使金樽空对月。天生我材必有用，千金散尽还复来。人生得意须尽欢，莫使金樽空对月。天生我材必有用，千金散尽还复来。人生得意须尽欢，莫使金樽空对月。天生我材必有用，千金散尽还复来。人生得意须尽欢，莫使金樽空对月。天生我材必有用，千金散尽还复来。人生得意须尽欢，莫使金樽空对月。天生我材必有用，千金散尽还复来。人生得意须尽欢，莫使金樽空对月。天生我材必有用，千金散尽还复来。人生得意须尽欢，莫使金樽空对月。天生我材必有用，千金散尽还复来。人生得意须尽欢，莫使金樽空对月。天生我材必有用，千金散尽还复来。人生得意须尽欢，莫使金樽空对月。天生我材必有用，千金散尽还复来。人生得意须尽欢，莫使金樽空对月。天生我材必有用，千金散尽还复来。";
            int counter = 0;//统计出现次数
            int index = str.IndexOf("人生");//
            while (index>-1)
            {
                
                counter++;
                index = str.IndexOf("人生", index+1);
            }
            System.Console.WriteLine("一共出现{0}",counter);
        }
    }
}
